README.org
#+TITLE: AmirrezaAsk Computing Environment
#+DESCRIPTION: My configurations for different tools I use on a daily basis.
#+OPTIONS: toc:4
#+EXPORT_FILE_NAME: index.html
* Introduction
This is my configuration file which will generate configurations for all tools I use on daily basis:
- Emacs
- Kitty ( Terminal Emulator )
- Zsh ( Shell )
- Git

* How to install ?
It's a fairly simple thing to do but remember this will override your current =kitty= and =emacs= config, so backup
them please.
#+BEGIN_SRC sh
  curl https://raw.githubusercontent.com/amirrezaask/dotfiles/master/.emacs.d/README.org > ~/.emacs.d/README.org &&\
  emacs --batch --eval "(require 'org)" --eval '(org-babel-tangle-file "~/.emacs.d/README.org")'
#+END_SRC
* Emacs
*** Personal Customization Variable
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Amirreza Askarpour")
  (setq user-email "raskarpour@gmail.com")
  (setq amirreza/font "Source Code Pro")
  ;; (setq amirreza/font "FiraCode Nerd Font Mono")
  ;; (setq amirreza/font "OperatorMono Nerd Font Light")
  ;; (setq amirreza/font "JetBrainsMono Nerd Font Mono")
  (setq amirreza/font-size "22")
  (setq amirreza/theme 'doom-dracula)
  (setq amirreza/transparent 95) ;; For terminal only
#+END_SRC
*** Init Files
**** early-init.el
From emacs 27 I think they added a file called =early-init.el= which will get sourced
before UI stuff happens in Emacs, so it's a good place to turn of UI things.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/early-init.el :mkdirp yes
(setq package-enable-at-startup nil) ;; Disable default package manager package.el
(tool-bar-mode 0) ;; disable top toolbar
(scroll-bar-mode 0) ;; disable scroll bar
(menu-bar-mode -1) ;; Disable menu bar
(setq gc-cons-threshold (* 100 1024 1024))
(setq read-process-output-max (* 1024 1024))
#+END_SRC
**** init.el
init.el will just load this file.
#+BEGIN_SRC emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes
  (setq vc-follow-symlinks t)
  (add-to-list 'load-path (expand-file-name "site-lisp" user-emacs-directory))
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
  (org-babel-load-file (expand-file-name "README.org" user-emacs-directory))
#+END_SRC
*** Package Manager
#+BEGIN_SRC emacs-lisp
  ;; Bootstrap straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq straight-use-package-by-default t)
#+END_SRC
