index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-01 Sun 04:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AmirrezaAsk Computing Environment</title>
<meta name="author" content="Amirreza Askarpour" />
<meta name="description" content="My configurations for different tools I use on a daily basis." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">AmirrezaAsk Computing Environment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org49a80f1">1. Introduction</a></li>
<li><a href="#orgf7fac34">2. How to install ?</a></li>
<li><a href="#org47a534c">3. Emacs</a>
<ul>
<li>
<ul>
<li><a href="#org90f288a">3.0.1. Personal Customization Variable</a></li>
<li><a href="#org6eed95d">3.0.2. Init Files</a></li>
<li><a href="#org371126b">3.0.3. Package Manager</a></li>
<li><a href="#org1699ac5">3.0.4. Basics and core settings</a></li>
<li><a href="#org7b25f37">3.0.5. Evil Mode</a></li>
<li><a href="#org640d93c">3.0.6. Windows and Buffers</a></li>
<li><a href="#orge84727a">3.0.7. Dired File Manager</a></li>
<li><a href="#org73588b1">3.0.8. Emacs Help</a></li>
<li><a href="#org9e31b3f">3.0.9. UI</a></li>
<li><a href="#orgf3f0aef">3.0.10. Completion</a></li>
<li><a href="#orga12387a">3.0.11. Editor</a></li>
<li><a href="#orgbcf8731">3.0.12. Org mode</a></li>
<li><a href="#orgbcfd94b">3.0.13. Git</a></li>
<li><a href="#orgd36e58b">3.0.14. Project management</a></li>
<li><a href="#org9a833b9">3.0.15. Programming</a></li>
<li><a href="#orgf9186e1">3.0.16. Workspaces</a></li>
<li><a href="#org462a0a3">3.0.17. macOS setup</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22446bf">4. Kitty</a>
<ul>
<li>
<ul>
<li><a href="#org655d788">4.0.1. Themes</a></li>
<li><a href="#orge69c6c0">4.0.2. Font</a></li>
<li><a href="#org0f8c816">4.0.3. Cursor</a></li>
<li><a href="#org3a18c3a">4.0.4. Performance</a></li>
<li><a href="#orgbf70fba">4.0.5. No Audio Bell</a></li>
<li><a href="#orga463911">4.0.6. Keybindings</a></li>
<li><a href="#org0fac086">4.0.7. Tab bar</a></li>
<li><a href="#orgb135776">4.0.8. macOS</a></li>
<li><a href="#org6f5b03a">4.0.9. Terminal Type</a></li>
<li><a href="#org1f12b0d">4.0.10. Background Opacity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4689887">5. Zsh</a>
<ul>
<li>
<ul>
<li><a href="#orgc1e0676">5.0.1. Shebang</a></li>
<li><a href="#org519966e">5.0.2. Antigen Setup</a></li>
<li><a href="#orgc39ab91">5.0.3. Plugins</a></li>
<li><a href="#org3990960">5.0.4. Environment Variables</a></li>
<li><a href="#orgd0eb8a5">5.0.5. Aliases</a></li>
<li><a href="#org7b3dd25">5.0.6. Starship prompt</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga319a47">6. Git Global Config</a>
<ul>
<li>
<ul>
<li><a href="#org288fcef">6.0.1. User Info</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org49a80f1" class="outline-2">
<h2 id="org49a80f1"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my configuration file which will generate configurations for all tools I use on daily basis:
</p>
<ul class="org-ul">
<li>Emacs</li>
<li>Kitty ( Terminal Emulator )</li>
<li>Zsh ( Shell )</li>
<li>Git</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7fac34" class="outline-2">
<h2 id="orgf7fac34"><span class="section-number-2">2.</span> How to install ?</h2>
<div class="outline-text-2" id="text-2">
<p>
It's a fairly simple thing to do but remember this will override your current <code>kitty</code> and <code>emacs</code> config, so backup
them please.
</p>
<div class="org-src-container">
<pre class="src src-sh">curl https://raw.githubusercontent.com/amirrezaask/dotfiles/master/.emacs.d/README.org &gt; ~/.emacs.d/README.org &amp;&amp;<span style="color: #f1fa8c;">\</span>
emacs --batch --eval <span style="color: #f1fa8c;">"(require 'org)"</span> --eval <span style="color: #f1fa8c;">'(org-babel-tangle-file "~/.emacs.d/README.org")'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org47a534c" class="outline-2">
<h2 id="org47a534c"><span class="section-number-2">3.</span> Emacs</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org90f288a" class="outline-4">
<h4 id="org90f288a"><span class="section-number-4">3.0.1.</span> Personal Customization Variable</h4>
<div class="outline-text-4" id="text-3-0-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> user-full-name <span style="color: #f1fa8c;">"Amirreza Askarpour"</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> user-email <span style="color: #f1fa8c;">"raskarpour@gmail.com"</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/font <span style="color: #f1fa8c;">"Source Code Pro"</span><span style="color: #61bfff;">)</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">(setq amirreza/font "FiraCode Nerd Font Mono")</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">(setq amirreza/font "OperatorMono Nerd Font Light")</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">(setq amirreza/font "JetBrainsMono Nerd Font Mono")</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/font-size <span style="color: #f1fa8c;">"22"</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/theme 'doom-palenight<span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/transparent 95<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">For terminal only</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6eed95d" class="outline-4">
<h4 id="org6eed95d"><span class="section-number-4">3.0.2.</span> Init Files</h4>
<div class="outline-text-4" id="text-3-0-2">
</div>
<ol class="org-ol">
<li><a id="org85c5a2d"></a>early-init.el<br />
<div class="outline-text-5" id="text-3-0-2-1">
<p>
From emacs 27 I think they added a file called <code>early-init.el</code> which will get sourced
before UI stuff happens in Emacs, so it's a good place to turn of UI things.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> package-enable-at-startup nil<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable default package manager package.el</span>
<span style="color: #61bfff;">(</span>tool-bar-mode 0<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">disable top toolbar</span>
<span style="color: #61bfff;">(</span>scroll-bar-mode 0<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">disable scroll bar</span>
<span style="color: #61bfff;">(</span>menu-bar-mode -1<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable menu bar</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> gc-cons-threshold <span style="color: #ff79c6;">(</span>* 100 1024 1024<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> read-process-output-max <span style="color: #ff79c6;">(</span>* 1024 1024<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org91f7f91"></a>init.el<br />
<div class="outline-text-5" id="text-3-0-2-2">
<p>
init.el will just load this file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> vc-follow-symlinks t<span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span>add-to-list 'load-path <span style="color: #ff79c6;">(</span>expand-file-name <span style="color: #f1fa8c;">"site-lisp"</span> user-emacs-directory<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span>add-to-list 'load-path <span style="color: #ff79c6;">(</span>expand-file-name <span style="color: #f1fa8c;">"lisp"</span> user-emacs-directory<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span>org-babel-load-file <span style="color: #ff79c6;">(</span>expand-file-name <span style="color: #f1fa8c;">"README.org"</span> user-emacs-directory<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org371126b" class="outline-4">
<h4 id="org371126b"><span class="section-number-4">3.0.3.</span> Package Manager</h4>
<div class="outline-text-4" id="text-3-0-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Bootstrap straight.el</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defvar</span> <span style="color: #ffc9e8;">bootstrap-version</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">let</span> <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">(</span>bootstrap-file
       <span style="color: #bd93f9;">(</span>expand-file-name <span style="color: #f1fa8c;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>bootstrap-version 6<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">unless</span> <span style="color: #50fa7b;">(</span>file-exists-p bootstrap-file<span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">with-current-buffer</span>
        <span style="color: #bd93f9;">(</span>url-retrieve-synchronously
         <span style="color: #f1fa8c;">"https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies<span style="color: #bd93f9;">)</span>
      <span style="color: #bd93f9;">(</span>goto-char <span style="color: #0189cc;">(</span>point-max<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span>
      <span style="color: #bd93f9;">(</span>eval-print-last-sexp<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>load bootstrap-file nil 'nomessage<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> straight-use-package-by-default t<span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
