.emacs.d/init.el
(setq user-full-name "Amirreza Askarpour")
(setq user-email "raskarpour@gmail.com")
;; (setq amirreza/font "Source Code Pro")
;; (setq amirreza/font "FiraCode Nerd Font Mono")
;; (setq amirreza/font "OperatorMono Nerd Font Light")
;; (setq amirreza/font "JetBrainsMono Nerd Font Mono")
(setq amirreza/font "Iosevka")
(setq amirreza/font-size "18")
(setq amirreza/theme 'gruber-darker)
(setq amirreza/transparent 100)


(setq vc-follow-symlinks t)
(add-to-list 'load-path (expand-file-name "site-lisp" user-emacs-directory))
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq straight-use-package-by-default t)
