index.html
<div id="outline-container-org1699ac5" class="outline-4">
<h4 id="org1699ac5"><span class="section-number-4">3.0.4.</span> Basics and core settings</h4>
<div class="outline-text-4" id="text-3-0-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> create-lockfiles nil<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Don't create .# files as lock.</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> native-comp-async-report-warnings-errors 'silent<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Silent Emacs 28 native compilation</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> make-backup-files nil<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable backup files ~file</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> auto-save-default nil<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable auto save files</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> inhibit-startup-screen t<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">No startup splash screen</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> use-dialog-box nil<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Do not use UI for questions</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> ring-bell-function 'ignore<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Do not beep please.</span>

<span style="color: #61bfff;">(</span>tool-bar-mode 0<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">disable top toolbar</span>
<span style="color: #61bfff;">(</span>scroll-bar-mode 0<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">disable scroll bar</span>
<span style="color: #61bfff;">(</span>menu-bar-mode -1<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable menu bar</span>



<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Copy PATH from default shell</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">exec-path-from-shell</span> <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>exec-path-from-shell-initialize<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> custom-file <span style="color: #ff79c6;">(</span>expand-file-name <span style="color: #f1fa8c;">"custom.el"</span> user-emacs-directory<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defalias</span> '<span style="color: #50fa7b;">yes-or-no-p</span> 'y-or-n-p<span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> echo-keystrokes 0.4<span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/find-file</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">if</span> <span style="color: #50fa7b;">(</span>vc-backend <span style="color: #bd93f9;">(</span>buffer-file-name<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>project-find-file<span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>call-interactively 'find-file<span style="color: #50fa7b;">)</span>
    <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/edit-emacs</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>find-file <span style="color: #50fa7b;">(</span>expand-file-name <span style="color: #f1fa8c;">"README.org"</span> user-emacs-directory<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/getenv</span> <span style="color: #ff79c6;">(</span>name default<span style="color: #ff79c6;">)</span>
  <span style="color: #8995ba;">"Get env if not defined use default"</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">let</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">(</span>value <span style="color: #0189cc;">(</span>getenv name<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">if</span> value
        value
      default
    <span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">general</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">For a beautiful keymap macro</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">hydra</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Make your keybindings stick</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">benchmark-init</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>add-hook 'after-init-hook 'benchmark-init/deactivate<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">gcmh</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>gcmh-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defmacro</span> <span style="color: #50fa7b;">amirreza/defhydra</span> <span style="color: #ff79c6;">(</span>name body heads<span style="color: #ff79c6;">)</span>
  `<span style="color: #ff79c6;">(</span>eval <span style="color: #50fa7b;">(</span>append '<span style="color: #bd93f9;">(</span>defhydra ,name ,body<span style="color: #bd93f9;">)</span> ,heads<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">general-def</span> <span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-c e e"</span> 'amirreza/edit-emacs<span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
