.emacs.d/init.el

(setq create-lockfiles nil) ;; Don't create .# files as lock.
(setq native-comp-async-report-warnings-errors 'silent) ;; Silent Emacs 28 native compilation
(setq make-backup-files nil) ;; Disable backup files ~file
(setq auto-save-default nil) ;; Disable auto save files
(setq inhibit-startup-screen t) ;; No startup splash screen
(setq use-dialog-box nil) ;; Do not use UI for questions
(setq ring-bell-function 'ignore) ;; Do not beep please.

(tool-bar-mode 0) ;; disable top toolbar
(scroll-bar-mode 0) ;; disable scroll bar
(menu-bar-mode -1) ;; Disable menu bar



;; Copy PATH from default shell
(use-package exec-path-from-shell :config
  (exec-path-from-shell-initialize))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(defalias 'yes-or-no-p 'y-or-n-p)

(setq echo-keystrokes 0.4)


(defun amirreza/find-file ()
  (interactive)
  (if (vc-backend (buffer-file-name))
      (project-find-file)
    (call-interactively 'find-file)
    ))

(defun amirreza/edit-emacs ()
  (interactive)
  (find-file (expand-file-name "README.org" user-emacs-directory)))


(defun amirreza/getenv (name default)
  "Get env if not defined use default"
  (let ((value (getenv name)))
    (if value
	value
      default
    )))

(use-package general) ;; For a beautiful keymap macro
(use-package hydra) ;; Make your keybindings stick

(use-package benchmark-init
  :config
  (add-hook 'after-init-hook 'benchmark-init/deactivate))

(use-package gcmh
  :init
  (gcmh-mode 1)
  )

(defmacro amirreza/defhydra (name body heads)
  `(eval (append '(defhydra ,name ,body) ,heads)))


(general-def :keymaps 'override "C-c e e" 'amirreza/edit-emacs)
