README.org
*** Evil Mode
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package undo-tree
    :init
    (global-undo-tree-mode 1))

  (use-package evil
    :init
    (setq IS-EVIL t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)
    (setq evil-undo-system 'undo-tree)
    (setq evil-split-window-below t)
    (setq evil-vsplit-window-right t)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :init
    (setq evil-collection-company-use-tng nil)  ;; Is this a bug in evil-collection?
    :custom
    (evil-collection-outline-bind-tab-p nil)
    :config
    (setq evil-collection-mode-list
	  (remove 'lispy evil-collection-mode-list))
    (evil-collection-init))


  (use-package evil-escape
    :after evil
    :init
    (setq evil-escape-key-sequence "jk"
	  evil-escape-unordered-key-sequence t)
    (evil-escape-mode))


  (general-evil-setup)

  ;; Help me with stuff
  (general-nmap
    :prefix "SPC"
    "h f" 'describe-function
    "h v" 'describe-variable
    "h k" 'describe-key)

  ;; window stuff
  (general-nmap
    :keymaps 'override
    "C-j" 'evil-window-down
    "C-k" 'evil-window-up
    "C-h" 'evil-window-left
    "C-l" 'evil-window-right)

  ;; Files and navigation
  (general-nmap
    :prefix "SPC"
    "SPC" 'amirreza/find-file
    "x" 'execute-extended-command
    "f f" 'find-file
    "p" 'amirreza/project-hydra/body)

#+END_SRC
*** Windows and Buffers
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :general
    (:keymaps 'override "C-x o" 'ace-window))


  (use-package bufler
    :general
    (:keymaps 'override "C-x C-b" 'bufler)
    )

  (use-package winner
    :init
    (winner-mode 1)
    )
#+END_SRC
