index.html
<div id="outline-container-org7b25f37" class="outline-4">
<h4 id="org7b25f37"><span class="section-number-4">3.0.5.</span> Evil Mode</h4>
<div class="outline-text-4" id="text-3-0-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">undo-tree</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>global-undo-tree-mode 1<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">evil</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> IS-EVIL t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-want-integration t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-want-keybinding nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-want-C-u-scroll t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-want-C-i-jump nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-respect-visual-line-mode t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-undo-system 'undo-tree<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-split-window-below t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-vsplit-window-right t<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>evil-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>define-key evil-insert-state-map <span style="color: #50fa7b;">(</span>kbd <span style="color: #f1fa8c;">"C-g"</span><span style="color: #50fa7b;">)</span> 'evil-normal-state<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>define-key evil-insert-state-map <span style="color: #50fa7b;">(</span>kbd <span style="color: #f1fa8c;">"C-h"</span><span style="color: #50fa7b;">)</span> 'evil-delete-backward-char-and-join<span style="color: #ff79c6;">)</span>

  <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Use visual line motions even outside of visual-line-mode buffers</span>
  <span style="color: #ff79c6;">(</span>evil-global-set-key 'motion <span style="color: #f1fa8c;">"j"</span> 'evil-next-visual-line<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>evil-global-set-key 'motion <span style="color: #f1fa8c;">"k"</span> 'evil-previous-visual-line<span style="color: #ff79c6;">)</span>

  <span style="color: #ff79c6;">(</span>evil-set-initial-state 'messages-buffer-mode 'normal<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>evil-set-initial-state 'dashboard-mode 'normal<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">evil-collection</span>
  <span style="color: #ffb86c;">:after</span> evil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-collection-company-use-tng nil<span style="color: #ff79c6;">)</span>  <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Is this a bug in evil-collection?</span>
  <span style="color: #ffb86c;">:custom</span>
  <span style="color: #ff79c6;">(</span>evil-collection-outline-bind-tab-p nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-collection-mode-list
        <span style="color: #50fa7b;">(</span>remove 'lispy evil-collection-mode-list<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>evil-collection-init<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">evil-escape</span>
  <span style="color: #ffb86c;">:after</span> evil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> evil-escape-key-sequence <span style="color: #f1fa8c;">"jk"</span>
        evil-escape-unordered-key-sequence t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>evil-escape-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span>general-evil-setup<span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Help me with stuff</span>
<span style="color: #61bfff;">(</span>general-nmap
  <span style="color: #ffb86c;">:prefix</span> <span style="color: #f1fa8c;">"SPC"</span>
  <span style="color: #f1fa8c;">"h f"</span> 'describe-function
  <span style="color: #f1fa8c;">"h v"</span> 'describe-variable
  <span style="color: #f1fa8c;">"h k"</span> 'describe-key<span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">window stuff</span>
<span style="color: #61bfff;">(</span>general-nmap
  <span style="color: #ffb86c;">:keymaps</span> 'override
  <span style="color: #f1fa8c;">"C-j"</span> 'evil-window-down
  <span style="color: #f1fa8c;">"C-k"</span> 'evil-window-up
  <span style="color: #f1fa8c;">"C-h"</span> 'evil-window-left
  <span style="color: #f1fa8c;">"C-l"</span> 'evil-window-right<span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Files and navigation</span>
<span style="color: #61bfff;">(</span>general-nmap
  <span style="color: #ffb86c;">:prefix</span> <span style="color: #f1fa8c;">"SPC"</span>
  <span style="color: #f1fa8c;">"SPC"</span> 'amirreza/find-file
  <span style="color: #f1fa8c;">"x"</span> 'execute-extended-command
  <span style="color: #f1fa8c;">"f f"</span> 'find-file
  <span style="color: #f1fa8c;">"p"</span> 'amirreza/project-hydra/body<span style="color: #61bfff;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org640d93c" class="outline-4">
<h4 id="org640d93c"><span class="section-number-4">3.0.6.</span> Windows and Buffers</h4>
<div class="outline-text-4" id="text-3-0-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ace-window</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-x o"</span> 'ace-window<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">bufler</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-x C-b"</span> 'bufler<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">winner</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>winner-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
