.emacs.d/init.el

(use-package ace-window
  :general
  (:keymaps 'override "C-x o" 'ace-window))


(use-package bufler
  :general
  (:keymaps 'override "C-x C-b" 'bufler)
  )

(use-package winner
  :init
  (winner-mode 1)
  )
