index.html
<div id="outline-container-orge84727a" class="outline-4">
<h4 id="orge84727a"><span class="section-number-4">3.0.7.</span> Dired File Manager</h4>
<div class="outline-text-4" id="text-3-0-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">dired</span> <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
    <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> dired-dwim-target t  <span style="color: #6272a4;">; </span><span style="color: #6272a4;">suggest a target for moving/copying intelligently</span>
        dired-hide-details-hide-symlink-targets nil
        <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">don't prompt to revert, just do it</span>
        dired-auto-revert-buffer #'dired-buffer-stale-p
        <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Always copy/delete recursively</span>
        dired-recursive-copies  'always
        dired-recursive-deletes 'top
        large-file-warning-threshold nil
        <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Ask whether destination dirs should get created when copying/removing files.</span>
        dired-create-destination-dirs 'ask
        <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Screens are larger nowadays, we can afford slightly larger thumbnails</span>
        image-dired-thumb-size 150<span style="color: #ff79c6;">)</span>

  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'dired-mode-map
            <span style="color: #f1fa8c;">"C-c C-e"</span> 'wdired-change-to-wdired-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">all-the-icons-dired</span>
  <span style="color: #ffb86c;">:hook</span> <span style="color: #ff79c6;">(</span>dired-mode . all-the-icons-dired-mode<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span>
 IS-MAC <span style="color: #ff79c6;">(</span>string-equal system-type <span style="color: #f1fa8c;">"darwin"</span><span style="color: #ff79c6;">)</span>
 IS-LINUX <span style="color: #ff79c6;">(</span>string-equal system-type <span style="color: #f1fa8c;">"linux"</span><span style="color: #ff79c6;">)</span>
 IS-WINDOWS <span style="color: #ff79c6;">(</span>string-equal system-type <span style="color: #f1fa8c;">"windows"</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">dired-x</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:hook</span> <span style="color: #ff79c6;">(</span>dired-mode . dired-omit-mode<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> dired-omit-verbose nil
        dired-omit-files
        <span style="color: #50fa7b;">(</span>concat dired-omit-files
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">^\\.DS_Store\\'"</span>
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">^\\.project</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">ile</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">?\\'"</span>
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">^\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">svn</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">git</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span>
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">^\\.ccls-cache\\'"</span>
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">\\.js</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">?\\.meta\\'"</span>
                <span style="color: #f1fa8c;">"</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">elc</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">o</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">pyo</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">swp</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">class</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Disable the prompt about whether I want to kill the Dired buffer for a</span>
  <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">deleted directory. Of course I do!</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> dired-clean-confirm-killing-deleted-buffers nil<span style="color: #ff79c6;">)</span>
  <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Let OS decide how to open certain files</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">when-let</span> <span style="color: #50fa7b;">(</span>cmd <span style="color: #bd93f9;">(</span><span style="color: #ff79c6;">cond</span> <span style="color: #0189cc;">(</span>IS-MAC <span style="color: #f1fa8c;">"open"</span><span style="color: #0189cc;">)</span>
                       <span style="color: #0189cc;">(</span>IS-LINUX <span style="color: #f1fa8c;">"xdg-open"</span><span style="color: #0189cc;">)</span>
                       <span style="color: #0189cc;">(</span>IS-WINDOWS <span style="color: #f1fa8c;">"start"</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">setq</span> dired-guess-shell-alist-user
          `<span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">docx</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">pdf</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">djvu</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">eps</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">jpe?g</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">png</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">gif</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">xpm</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">xcf</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.csv\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.tex\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">mp4</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">mkv</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">avi</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">flv</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">rm</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">rmvb</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">ogv</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">\\.part</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">?\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">(?:</span><span style="color: #f1fa8c;">mp3</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">|</span><span style="color: #f1fa8c;">flac</span><span style="color: #bd93f9; font-weight: bold;">\\</span><span style="color: #bd93f9; font-weight: bold;">)</span><span style="color: #f1fa8c;">\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.html?\\'"</span> ,cmd<span style="color: #0189cc;">)</span>
            <span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"\\.md\\'"</span> ,cmd<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">dired-git-info</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'dired-mode-map
            <span style="color: #f1fa8c;">"C-c m g"</span> 'dired-git-info<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> mediaplayer <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">cond</span>
           <span style="color: #50fa7b;">(</span>IS-MAC <span style="color: #f1fa8c;">"/Applications/VLC.app/Contents/MacOS/VLC"</span><span style="color: #50fa7b;">)</span>
           <span style="color: #50fa7b;">(</span>IS-LINUX <span style="color: #f1fa8c;">"vlc"</span><span style="color: #50fa7b;">)</span>
           <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> pdfviewer <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">cond</span>
                 <span style="color: #50fa7b;">(</span>IS-MAC <span style="color: #f1fa8c;">"open"</span><span style="color: #50fa7b;">)</span>
                 <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> imageviewer <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">cond</span>
                   <span style="color: #50fa7b;">(</span>IS-MAC <span style="color: #f1fa8c;">"open"</span><span style="color: #50fa7b;">)</span>
                   <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">openwith</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>openwith-mode<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> openwith-associations
        <span style="color: #50fa7b;">(</span>list
          <span style="color: #bd93f9;">(</span>list <span style="color: #0189cc;">(</span>openwith-make-extension-regexp
                '<span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"mpg"</span> <span style="color: #f1fa8c;">"mpeg"</span> <span style="color: #f1fa8c;">"mp3"</span> <span style="color: #f1fa8c;">"mp4"</span>
                  <span style="color: #f1fa8c;">"avi"</span> <span style="color: #f1fa8c;">"wmv"</span> <span style="color: #f1fa8c;">"wav"</span> <span style="color: #f1fa8c;">"mov"</span> <span style="color: #f1fa8c;">"flv"</span>
                  <span style="color: #f1fa8c;">"ogm"</span> <span style="color: #f1fa8c;">"ogg"</span> <span style="color: #f1fa8c;">"mkv"</span><span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span>
                mediaplayer
                '<span style="color: #0189cc;">(</span>file<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span>
          <span style="color: #bd93f9;">(</span>list <span style="color: #0189cc;">(</span>openwith-make-extension-regexp
                '<span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"xbm"</span> <span style="color: #f1fa8c;">"pbm"</span> <span style="color: #f1fa8c;">"pgm"</span> <span style="color: #f1fa8c;">"ppm"</span> <span style="color: #f1fa8c;">"pnm"</span>
                  <span style="color: #f1fa8c;">"png"</span> <span style="color: #f1fa8c;">"gif"</span> <span style="color: #f1fa8c;">"bmp"</span> <span style="color: #f1fa8c;">"tif"</span> <span style="color: #f1fa8c;">"jpeg"</span> <span style="color: #f1fa8c;">"jpg"</span><span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span>
                  imageviewer
                  '<span style="color: #0189cc;">(</span>file<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span>
          <span style="color: #bd93f9;">(</span>list <span style="color: #0189cc;">(</span>openwith-make-extension-regexp
                '<span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"pdf"</span><span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span>
                pdfviewer
                '<span style="color: #0189cc;">(</span>file<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
