.emacs.d/init.el

(use-package dired :straight nil
  :init
    (setq dired-dwim-target t  ; suggest a target for moving/copying intelligently
	dired-hide-details-hide-symlink-targets nil
	;; don't prompt to revert, just do it
	dired-auto-revert-buffer #'dired-buffer-stale-p
	;; Always copy/delete recursively
	dired-recursive-copies  'always
	dired-recursive-deletes 'top
	large-file-warning-threshold nil
	;; Ask whether destination dirs should get created when copying/removing files.
	dired-create-destination-dirs 'ask
	;; Screens are larger nowadays, we can afford slightly larger thumbnails
	image-dired-thumb-size 150)

  :general
  (:keymaps 'dired-mode-map
	    "C-c C-e" 'wdired-change-to-wdired-mode))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  )

(setq
 IS-MAC (string-equal system-type "darwin")
 IS-LINUX (string-equal system-type "linux")
 IS-WINDOWS (string-equal system-type "windows"))

(use-package dired-x
  :straight nil
  :hook (dired-mode . dired-omit-mode)
  :config
  (setq dired-omit-verbose nil
	dired-omit-files
	(concat dired-omit-files
		"\\|^\\.DS_Store\\'"
		"\\|^\\.project\\(?:ile\\)?\\'"
		"\\|^\\.\\(?:svn\\|git\\)\\'"
		"\\|^\\.ccls-cache\\'"
		"\\|\\(?:\\.js\\)?\\.meta\\'"
		"\\|\\.\\(?:elc\\|o\\|pyo\\|swp\\|class\\)\\'"))
  ;; Disable the prompt about whether I want to kill the Dired buffer for a
  ;; deleted directory. Of course I do!
  (setq dired-clean-confirm-killing-deleted-buffers nil)
  ;; Let OS decide how to open certain files
  (when-let (cmd (cond (IS-MAC "open")
		       (IS-LINUX "xdg-open")
		       (IS-WINDOWS "start")))
    (setq dired-guess-shell-alist-user
	  `(("\\.\\(?:docx\\|pdf\\|djvu\\|eps\\)\\'" ,cmd)
	    ("\\.\\(?:jpe?g\\|png\\|gif\\|xpm\\)\\'" ,cmd)
	    ("\\.\\(?:xcf\\)\\'" ,cmd)
	    ("\\.csv\\'" ,cmd)
	    ("\\.tex\\'" ,cmd)
	    ("\\.\\(?:mp4\\|mkv\\|avi\\|flv\\|rm\\|rmvb\\|ogv\\)\\(?:\\.part\\)?\\'" ,cmd)
	    ("\\.\\(?:mp3\\|flac\\)\\'" ,cmd)
	    ("\\.html?\\'" ,cmd)
	    ("\\.md\\'" ,cmd)))))


(use-package dired-git-info
  :general
  (:keymaps 'dired-mode-map
	    "C-c m g" 'dired-git-info))

(setq mediaplayer (cond
	   (IS-MAC "/Applications/VLC.app/Contents/MacOS/VLC")
	   (IS-LINUX "vlc")
	   ))


(setq pdfviewer (cond
		 (IS-MAC "open")
		 ))

(setq imageviewer (cond
		   (IS-MAC "open")
		   ))

(use-package openwith
  :init
  (openwith-mode)
  :config
  (setq openwith-associations
	(list
	  (list (openwith-make-extension-regexp
		'("mpg" "mpeg" "mp3" "mp4"
		  "avi" "wmv" "wav" "mov" "flv"
		  "ogm" "ogg" "mkv"))
		mediaplayer
		'(file))
	  (list (openwith-make-extension-regexp
		'("xbm" "pbm" "pgm" "ppm" "pnm"
		  "png" "gif" "bmp" "tif" "jpeg" "jpg"))
		  imageviewer
		  '(file))
	  (list (openwith-make-extension-regexp
		'("pdf"))
		pdfviewer
		'(file)))))
