index.html
<div id="outline-container-org73588b1" class="outline-4">
<h4 id="org73588b1"><span class="section-number-4">3.0.8.</span> Emacs Help</h4>
<div class="outline-text-4" id="text-3-0-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">helpful</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'global-map
  <span style="color: #50fa7b;">[</span>remap describe-key<span style="color: #50fa7b;">]</span> 'helpful-key
  <span style="color: #50fa7b;">[</span>remap describe-function<span style="color: #50fa7b;">]</span> 'helpful-callable
  <span style="color: #50fa7b;">[</span>remap describe-variable<span style="color: #50fa7b;">]</span> 'helpful-variable<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9e31b3f" class="outline-4">
<h4 id="org9e31b3f"><span class="section-number-4">3.0.9.</span> UI</h4>
<div class="outline-text-4" id="text-3-0-9">
</div>
<ol class="org-ol">
<li><a id="org2ff12a0"></a>Themes<br />
<div class="outline-text-5" id="text-3-0-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">all-the-icons</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ef-themes</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">doom-themes</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">gruber-darker-theme</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Add custom themes path to themes load path</span>
<span style="color: #61bfff;">(</span>add-to-list 'custom-theme-load-path
             <span style="color: #ff79c6;">(</span>expand-file-name <span style="color: #f1fa8c;">"themes"</span> user-emacs-directory<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/--current-theme nil<span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/switch-theme</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">let</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">(</span>theme <span style="color: #0189cc;">(</span>intern <span style="color: #61bfff;">(</span>completing-read <span style="color: #f1fa8c;">"Theme: "</span> <span style="color: #ff79c6;">(</span>mapcar #'symbol-name
                                                          <span style="color: #50fa7b;">(</span>custom-available-themes<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>amirreza/load-theme theme<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/load-theme</span> <span style="color: #ff79c6;">(</span>theme<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">when</span> <span style="color: #50fa7b;">(</span>not <span style="color: #bd93f9;">(</span>eq amirreza/--current-theme nil<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>disable-theme amirreza/--current-theme<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> amirreza/--current-theme theme<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>load-theme amirreza/--current-theme t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">unless</span> <span style="color: #50fa7b;">(</span>display-graphic-p<span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">when</span> amirreza/transparent
      <span style="color: #bd93f9;">(</span>set-face-background 'default <span style="color: #f1fa8c;">"0"</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span>amirreza/load-theme amirreza/theme<span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">general-def</span> <span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-c t t"</span> 'amirreza/switch-theme<span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
<ol class="org-ol">
