.emacs.d/init.el

(use-package helpful
  :general
  (:keymaps 'global-map
  [remap describe-key] 'helpful-key
  [remap describe-function] 'helpful-callable
  [remap describe-variable] 'helpful-variable))

(use-package all-the-icons)
(use-package ef-themes)
(use-package doom-themes)
(use-package gruber-darker-theme)

;; Add custom themes path to themes load path
(add-to-list 'custom-theme-load-path
	     (expand-file-name "themes" user-emacs-directory))

(setq amirreza/--current-theme nil)

(defun amirreza/switch-theme ()
  (interactive)
  (let ((theme (intern (completing-read "Theme: " (mapcar #'symbol-name
							  (custom-available-themes))))))
    (amirreza/load-theme theme)))

(defun amirreza/load-theme (theme)
  (when (not (eq amirreza/--current-theme nil))
    (disable-theme amirreza/--current-theme))
  (setq amirreza/--current-theme theme)
  (load-theme amirreza/--current-theme t))

(amirreza/load-theme amirreza/theme)
(general-def :keymaps 'override "C-c t t" 'amirreza/switch-theme)
