index.html
<li><a id="org72a15f6"></a>My Custom Jonathan Blow esque theme<br />
<div class="outline-text-7" id="text-3-0-9-1-0-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6272a4;">;;; </span><span style="color: #6272a4;">jblow-theme.el --- Theme copied from jonathan blow emacs theme  -*- lexical-binding: t; -*-</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Copyright (C) 2022  Amirreza Askarpour</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Author: Amirreza Askarpour <a href="mailto:amirreza%40amirrezas-MacBook-Pro.local">&lt;amirreza@amirrezas-MacBook-Pro.local&gt;</a></span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Keywords: lisp</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">This program is free software; you can redistribute it and/or modify</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">it under the terms of the GNU General Public License as published by</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">the Free Software Foundation, either version 3 of the License, or</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">(at your option) any later version.</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">This program is distributed in the hope that it will be useful,</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">but WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">GNU General Public License for more details.</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">You should have received a copy of the GNU General Public License</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">along with this program.  If not, see <a href="https://www.gnu.org/licenses/">&lt;https://www.gnu.org/licenses/&gt;</a>.</span>

<span style="color: #6272a4;">;;; </span><span style="color: #6272a4;">Commentary:</span>

<span style="color: #6272a4;">;; </span>

<span style="color: #6272a4;">;;; </span><span style="color: #6272a4;">Code:</span>



<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">deftheme</span> <span style="color: #bd93f9;">jblow</span> <span style="color: #8995ba;">"Theme from Great Jonathan Blow"</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">let*</span> <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">(</span>background <span style="color: #f1fa8c;">"#072626"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>selection <span style="color: #f1fa8c;">"#0000ff"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>keyword <span style="color: #f1fa8c;">"#d4d4d4"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>comment <span style="color: #f1fa8c;">"#118a1a"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>string <span style="color: #f1fa8c;">"#2ec09c"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>variable <span style="color: #f1fa8c;">"#c8d4ec"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>warning <span style="color: #f1fa8c;">"#504038"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>constant <span style="color: #f1fa8c;">"#7ad0c6"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>cursor <span style="color: #f1fa8c;">"green"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>mode-line <span style="color: #f1fa8c;">"#d3b58d"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>function <span style="color: #f1fa8c;">"#ffffff"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>macro <span style="color: #f1fa8c;">"#8cde94"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>punctuation <span style="color: #f1fa8c;">"#8cde94"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>hl-line <span style="color: #f1fa8c;">"#084040"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>builtin <span style="color: #f1fa8c;">"#ffffff"</span><span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level1 function<span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level2 function<span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level3 function<span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level4 function<span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level5 function<span style="color: #50fa7b;">)</span>
      <span style="color: #50fa7b;">(</span>org-level6 function<span style="color: #50fa7b;">)</span>
      <span style="color: #ff79c6;">)</span>

  <span style="color: #ff79c6;">(</span>custom-theme-set-faces
   'jblow

   `<span style="color: #50fa7b;">(</span>default <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> <span style="color: #f1fa8c;">"#d3b58d"</span> <span style="color: #ffb86c;">:background</span> ,background<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>cursor <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:background</span> ,cursor<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>

   `<span style="color: #50fa7b;">(</span>font-lock-keyword-face           <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,keyword<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-type-face              <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,punctuation<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-constant-face          <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,constant<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-variable-name-face     <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,variable<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-builtin-face           <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,builtin<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-string-face            <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,string<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-comment-face           <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,comment<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-comment-delimiter-face <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,comment<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-doc-face               <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,comment<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-function-name-face     <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,function<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-doc-string-face        <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,string<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-preprocessor-face      <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,macro<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>font-lock-warning-face           <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,warning<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>org-level-4 <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> ,org-level4<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>

   `<span style="color: #50fa7b;">(</span>mode-line <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:foreground</span> <span style="color: #f1fa8c;">"black"</span> <span style="color: #ffb86c;">:background</span> ,mode-line<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>region <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #61bfff;">(</span><span style="color: #ffb86c;">:background</span> ,selection<span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>hl-line <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #ffb86c;">:background</span> ,hl-line<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>highlight <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #ffb86c;">:foreground</span> nil <span style="color: #ffb86c;">:background</span> ,selection<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   `<span style="color: #50fa7b;">(</span>persp-selected-face <span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span>t <span style="color: #ffb86c;">:foreground</span> <span style="color: #f1fa8c;">"#ffffff"</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span>
   <span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>


<span style="color: #6272a4;">;;;</span><span style="color: #6272a4;">###</span><span style="color: #f1fa8c;">autoload</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">when</span> load-file-name
  <span style="color: #ff79c6;">(</span>add-to-list 'custom-theme-load-path
               <span style="color: #50fa7b;">(</span>file-name-as-directory <span style="color: #bd93f9;">(</span>file-name-directory load-file-name<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span>provide-theme 'jblow<span style="color: #61bfff;">)</span>
<span style="color: #6272a4;">;;; </span><span style="color: #6272a4;">jblow-theme.el ends here</span>

</pre>
</div>
</div>
</li>
</ol>
</li>
