index.html
<li><a id="org950878d"></a>Modeline<br />
<div class="outline-text-5" id="text-3-0-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">doom-modeline</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> doom-modeline-height 35<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>doom-modeline-mode 1<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org37e013f"></a>Font<br />
<div class="outline-text-5" id="text-3-0-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Font settings</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/display-benq</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> amirreza/font-size <span style="color: #f1fa8c;">"23"</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>set-frame-font <span style="color: #50fa7b;">(</span>concat amirreza/font <span style="color: #f1fa8c;">" "</span> amirreza/font-size<span style="color: #50fa7b;">)</span> nil t<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">My font setup for my laptop setup</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/display-mac</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> amirreza/font-size <span style="color: #f1fa8c;">"15"</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>set-frame-font <span style="color: #50fa7b;">(</span>concat amirreza/font <span style="color: #f1fa8c;">" "</span> amirreza/font-size<span style="color: #50fa7b;">)</span> nil t<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Interactively ask for font size</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/set-font</span> <span style="color: #ff79c6;">(</span>size<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span> <span style="color: #f1fa8c;">"sSize: "</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> amirreza/font-size size<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>set-frame-font <span style="color: #50fa7b;">(</span>concat amirreza/font <span style="color: #f1fa8c;">" "</span> amirreza/font-size<span style="color: #50fa7b;">)</span> nil t<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Reload font settings</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/reload-font</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>set-frame-font <span style="color: #50fa7b;">(</span>concat amirreza/font <span style="color: #f1fa8c;">" "</span> amirreza/font-size<span style="color: #50fa7b;">)</span> nil t<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span>amirreza/reload-font<span style="color: #61bfff;">)</span>

</pre>
</div>
</div>
</li>
<li><a id="orgf5f50c3"></a>Cursor<br />
<div class="outline-text-5" id="text-3-0-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq-default</span> cursor-type 'box<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">instead of box use a horizontal line.</span>
<span style="color: #61bfff;">(</span>set-cursor-color 'red<span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span>blink-cursor-mode -1<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">no blinking cursor.</span>
</pre>
</div>
</div>
</li>
<li><a id="orgbdda380"></a>Transparency<br />
<div class="outline-text-5" id="text-3-0-9-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span>set-frame-parameter <span style="color: #ff79c6;">(</span>selected-frame<span style="color: #ff79c6;">)</span> 'alpha <span style="color: #ff79c6;">(</span>list amirreza/transparent amirreza/transparent<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span>add-to-list 'default-frame-alist <span style="color: #ff79c6;">(</span>append '<span style="color: #50fa7b;">(</span>alpha<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">(</span>list amirreza/transparent amirreza/transparent<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf3f0aef" class="outline-4">
<h4 id="orgf3f0aef"><span class="section-number-4">3.0.10.</span> Completion</h4>
<div class="outline-text-4" id="text-3-0-10">
</div>
<ol class="org-ol">
<li><a id="orgff94d85"></a>In-Buffer Completion<br />
<div class="outline-text-5" id="text-3-0-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">corfu</span>
  <span style="color: #ffb86c;">:straight</span>
  <span style="color: #ff79c6;">(</span>corfu <span style="color: #ffb86c;">:type</span> git <span style="color: #ffb86c;">:host</span> github <span style="color: #ffb86c;">:repo</span> <span style="color: #f1fa8c;">"emacs-straight/corfu"</span> <span style="color: #ffb86c;">:files</span> <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"*"</span> <span style="color: #f1fa8c;">"extensions/*.el"</span> <span style="color: #bd93f9;">(</span><span style="color: #ffb86c;">:exclude</span> <span style="color: #f1fa8c;">".git"</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>

  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> corfu-auto t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> corfu-auto-delay 0.1<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>global-corfu-mode<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>corfu-history-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>corfu-echo-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>corfu-popupinfo-mode 1<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">corfu-terminal</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>corfu-terminal-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">corfu-prescient</span>
  <span style="color: #ffb86c;">:after</span> prescient
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>corfu-prescient-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
