.emacs.d/init.el

(use-package doom-modeline
  :if nil
  :init
  (setq doom-modeline-height 35)
  (setq doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-mode 1))

;; Font settings
(defun amirreza/display-benq ()
  (interactive)
  (setq amirreza/font-size "23")
  (set-frame-font (concat amirreza/font " " amirreza/font-size) nil t))

;; My font setup for my laptop setup
(defun amirreza/display-mac ()
  (interactive)
  (setq amirreza/font-size "15")
  (set-frame-font (concat amirreza/font " " amirreza/font-size) nil t))

;; Interactively ask for font size
(defun amirreza/set-font-size (size)
  (interactive "sSize: ")
  (setq amirreza/font-size size)
  (set-frame-font (concat amirreza/font " " amirreza/font-size) nil t))

;; Reload font settings
(defun amirreza/reload-font ()
  (interactive)
  (set-frame-font (concat amirreza/font " " amirreza/font-size) nil t))

(amirreza/reload-font)

(setq-default cursor-type 'box) ;; instead of box use a horizontal line.
(set-cursor-color 'red)
(blink-cursor-mode -1) ;; no blinking cursor.
(global-hl-line-mode)

(set-frame-parameter (selected-frame) 'alpha (list amirreza/transparent amirreza/transparent))
(add-to-list 'default-frame-alist (append '(alpha) (list amirreza/transparent amirreza/transparent)))

(use-package corfu
  :straight
  (corfu :type git :host github :repo "emacs-straight/corfu" :files ("*" "extensions/*.el" (:exclude ".git")))

  :init
  (setq corfu-auto t)
  (setq corfu-auto-delay 0.1)
  :config
  (global-corfu-mode)
  (corfu-history-mode 1)
  (corfu-echo-mode 1)
  (corfu-popupinfo-mode 1))

(use-package corfu-terminal
  :config
  (corfu-terminal-mode))

(use-package corfu-prescient
  :after prescient
  :config
  (corfu-prescient-mode))
