README.org
**** Minibuffer Completion
#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :config
    (setq completion-cycle-threshold 3)
    (setq tab-always-indent 'complete))

  (use-package vertico
    :init
    (setq vertico-count 15)
    (setq vertico-cycle t)

    :config
    (vertico-mode))

  (use-package consult
    :init
    (setq consult-async-min-input 1))

  (use-package marginalia
    :config
    (marginalia-mode))

  (use-package orderless
    :config
    (setq completion-styles '(orderless basic)
	completion-category-defaults nil
	completion-category-overrides '((file (styles partial-completion)))))


  (use-package vertico-prescient
    :after prescient
    :config
    (vertico-prescient-mode))

  ;; Icons in minibuffer completion
  (use-package all-the-icons-completion
    :init
    (all-the-icons-completion-mode))

  ;; TODO: Maybe a context like completion
  ;; for example in org mode have a key to open minibuffer with just org mode functions
#+END_SRC
*** Editor
#+BEGIN_SRC emacs-lisp
  (use-package olivetti
    :init
    (setq olivetti-body-width 100))

  ;; Search and replace beautifuly
  (use-package wgrep)
  ;; Ripgrep
  (use-package rg)

  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))

  (use-package delsel
    :straight nil
    :config
    (delete-selection-mode 1) ;; When a region of text is selected and then something is typed remove text and replace with what has been typed.
    )

  (use-package paren
    :straight nil
    :init
    (setq show-paren-delay 0) ;; highlight matching parens instantly.
    :config
    (show-paren-mode 1) ;; Highlight matching parens
    )

  (use-package display-line-numbers
    :straight nil
    :init
    (setq display-line-numbers-type 'relative) ;; relative line numbers
    :config
    (global-display-line-numbers-mode 1) ;; enable line numbers globaly
    )

  (defun amirreza/up-center ()
    (interactive)
    (previous-line (/ (window-height) 2))
    (recenter-top-bottom))

  (defun amirreza/down-center ()
    (interactive)
    (next-line (/ (window-height) 2))
    (recenter-top-bottom))

  ;; Best movement ever ?????
  (setq recenter-positions '(middle))

  (general-def :keymaps 'global-map
    "M-p" 'amirreza/up-center
    "M-n" 'amirreza/down-center
    )

  (use-package expand-region
    :general
    (:keymaps 'global-map
	      "C-=" 'er/expand-region
	      "C--" 'er/contract-region
	      ))

  ;; really important key if you use emacs in terminal
  (use-package simple
    :straight nil
    :general
    (:keymaps 'override "C-q" 'set-mark-command))
#+END_SRC
