index.html
<li><a id="org4a44ab0"></a>Minibuffer Completion<br />
<div class="outline-text-5" id="text-3-0-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">emacs</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> completion-cycle-threshold 3<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> tab-always-indent 'complete<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">vertico</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> vertico-count 15<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> vertico-cycle t<span style="color: #ff79c6;">)</span>

  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>vertico-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">consult</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> consult-async-min-input 1<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">marginalia</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>marginalia-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">orderless</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> completion-styles '<span style="color: #50fa7b;">(</span>orderless basic<span style="color: #50fa7b;">)</span>
      completion-category-defaults nil
      completion-category-overrides '<span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">(</span>file <span style="color: #0189cc;">(</span>styles partial-completion<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">vertico-prescient</span>
  <span style="color: #ffb86c;">:after</span> prescient
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>vertico-prescient-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Icons in minibuffer completion</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">all-the-icons-completion</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>all-the-icons-completion-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">TODO: Maybe a context like completion</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">for example in org mode have a key to open minibuffer with just org mode functions</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga12387a" class="outline-4">
<h4 id="orga12387a"><span class="section-number-4">3.0.11.</span> Editor</h4>
<div class="outline-text-4" id="text-3-0-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">olivetti</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> olivetti-body-width 100<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Search and replace beautifuly</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">wgrep</span><span style="color: #61bfff;">)</span>
<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Ripgrep</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">rg</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">rainbow-delimiters</span>
  <span style="color: #ffb86c;">:hook</span>
  <span style="color: #ff79c6;">(</span>prog-mode . rainbow-delimiters-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">delsel</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>delete-selection-mode 1<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">When a region of text is selected and then something is typed remove text and replace with what has been typed.</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">paren</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> show-paren-delay 0<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">highlight matching parens instantly.</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>show-paren-mode 1<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Highlight matching parens</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">display-line-numbers</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> display-line-numbers-type 'relative<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">relative line numbers</span>
  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span>global-display-line-numbers-mode 1<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">enable line numbers globaly</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/up-center</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>previous-line <span style="color: #50fa7b;">(</span>/ <span style="color: #bd93f9;">(</span>window-height<span style="color: #bd93f9;">)</span> 2<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>recenter-top-bottom<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/down-center</span> <span style="color: #ff79c6;">()</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>next-line <span style="color: #50fa7b;">(</span>/ <span style="color: #bd93f9;">(</span>window-height<span style="color: #bd93f9;">)</span> 2<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>recenter-top-bottom<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Best movement ever ?????</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> recenter-positions '<span style="color: #ff79c6;">(</span>middle<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">general-def</span> <span style="color: #ffb86c;">:keymaps</span> 'global-map
  <span style="color: #f1fa8c;">"M-p"</span> 'amirreza/up-center
  <span style="color: #f1fa8c;">"M-n"</span> 'amirreza/down-center
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">expand-region</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'global-map
            <span style="color: #f1fa8c;">"C-="</span> 'er/expand-region
            <span style="color: #f1fa8c;">"C--"</span> 'er/contract-region
            <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #6272a4;">;; </span><span style="color: #6272a4;">really important key if you use emacs in terminal</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">simple</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-q"</span> 'set-mark-command<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
