index.html
<div id="outline-container-orgbcf8731" class="outline-4">
<h4 id="orgbcf8731"><span class="section-number-4">3.0.12.</span> Org mode</h4>
<div class="outline-text-4" id="text-3-0-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">org</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> org-use-property-inheritance t<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> org-startup-folded t<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Start org mode all headers collapsed</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> org-src-window-setup 'current-window<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> org-src-tab-acts-natively nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/org-code-block</span> <span style="color: #50fa7b;">()</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>insert <span style="color: #bd93f9;">(</span>format <span style="color: #f1fa8c;">"#+BEGIN_SRC %s\n\n#+END_SRC"</span>
                    <span style="color: #0189cc;">(</span>completing-read <span style="color: #f1fa8c;">"Language: "</span>
                                     '<span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"emacs-lisp"</span>
                                       <span style="color: #f1fa8c;">"go"</span>
                                       <span style="color: #f1fa8c;">"rust"</span>
                                       <span style="color: #f1fa8c;">"python"</span>
                                       <span style="color: #f1fa8c;">"lua"</span>
                                       <span style="color: #f1fa8c;">"bash"</span>
                                       <span style="color: #f1fa8c;">"sh"</span>
                                       <span style="color: #f1fa8c;">"fish"</span>
                                       <span style="color: #f1fa8c;">"java"</span>
                                       <span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>

  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/org-disable-tangle</span> <span style="color: #50fa7b;">()</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>insert <span style="color: #f1fa8c;">":PROPERTIES:</span>
<span style="color: #f1fa8c;">:header-args:    :tangle no</span>
<span style="color: #f1fa8c;">:END:"</span>
            <span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>

  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defhydra</span> amirreza/org-mode-hydra <span style="color: #50fa7b;">(</span><span style="color: #ffb86c;">:exit</span> t<span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"l"</span> org-toggle-link-display <span style="color: #f1fa8c;">"Toggle Link Display"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"b"</span> amirreza/org-code-block <span style="color: #f1fa8c;">"Insert a Code Block"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"n"</span> amirreza/org-disable-tangle <span style="color: #f1fa8c;">"Disable Tangle PROPERTIES"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"e"</span> org-export-dispatch <span style="color: #f1fa8c;">"Export"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"o"</span> org-open-at-point <span style="color: #f1fa8c;">"Open At Point"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"h"</span> <span style="color: #bd93f9;">(</span><span style="color: #ff79c6;">lambda</span> <span style="color: #0189cc;">()</span> <span style="color: #0189cc;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #0189cc;">)</span> <span style="color: #0189cc;">(</span>org-export-as 'html<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span> <span style="color: #f1fa8c;">"Org Export To HTML"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"t"</span>  org-todo <span style="color: #f1fa8c;">"Open At Point"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'org-mode-map
            <span style="color: #f1fa8c;">"C-c m"</span> 'amirreza/org-mode-hydra/body<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'org-src-mode-map
            <span style="color: #f1fa8c;">"C-c C-c"</span> #'org-edit-src-exit
            <span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:states</span> 'normal <span style="color: #ffb86c;">:keymaps</span> 'org-mode-map <span style="color: #f1fa8c;">"SPC m"</span> 'amirreza/org-mode-hydra/body<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ox-reveal</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ob-go</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ob-rust</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">ob-php</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">htmlize</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">org-bullets</span>
  <span style="color: #ffb86c;">:hook</span>
  <span style="color: #ff79c6;">(</span>org-mode . org-bullets-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">evil-org</span>
  <span style="color: #ffb86c;">:if</span> <span style="color: #ff79c6;">(</span>boundp 'IS-EVIL<span style="color: #ff79c6;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Only if evil mode is enabled</span>
  <span style="color: #ffb86c;">:hook</span> <span style="color: #ff79c6;">(</span>org-mode . evil-org-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbcfd94b" class="outline-4">
<h4 id="orgbcfd94b"><span class="section-number-4">3.0.13.</span> Git</h4>
<div class="outline-text-4" id="text-3-0-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">git-gutter</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>global-git-gutter-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">magit</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'global-map <span style="color: #f1fa8c;">"C-x g"</span> 'magit<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:states</span> 'normal <span style="color: #f1fa8c;">"SPC g"</span> 'magit<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd36e58b" class="outline-4">
<h4 id="orgd36e58b"><span class="section-number-4">3.0.14.</span> Project management</h4>
<div class="outline-text-4" id="text-3-0-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">project</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"C-x p"</span> 'amirreza/project-hydra/body<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defhydra</span> amirreza/project-hydra <span style="color: #50fa7b;">(</span><span style="color: #ffb86c;">:exit</span> t<span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"f"</span> project-find-file <span style="color: #f1fa8c;">"Find File"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"p"</span> project-switch-project <span style="color: #f1fa8c;">"Switch To Project"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"b"</span> project-buffers <span style="color: #f1fa8c;">"Find Buffer In Project"</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"c"</span> project-compile <span style="color: #f1fa8c;">"Compile Project"</span><span style="color: #50fa7b;">)</span>
  <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
