.emacs.d/init.el
  (setq org-use-property-inheritance t)
  (setq org-startup-folded t) ;; Start org mode all headers collapsed
  (setq org-src-window-setup 'current-window)
  (setq org-src-tab-acts-natively nil)
  (defun amirreza/org-code-block ()
    (interactive)
    (insert (format "#+BEGIN_SRC %s\n\n#+END_SRC"
		    (completing-read "Language: "
				     '("emacs-lisp"
				       "go"
				       "rust"
				       "python"
				       "lua"
				       "bash"
				       "sh"
				       "fish"
				       "java"
				       )))))

  (defun amirreza/org-disable-tangle ()
    (interactive)
    (insert ":PROPERTIES:
:header-args:    :tangle no
:END:"
	    ))

  (defhydra amirreza/org-mode-hydra (:exit t)
    ("l" org-toggle-link-display "Toggle Link Display")
    ("b" amirreza/org-code-block "Insert a Code Block")
    ("n" amirreza/org-disable-tangle "Disable Tangle PROPERTIES")
    ("e" org-export-dispatch "Export")
    ("o" org-open-at-point "Open At Point")
    ("h" (lambda () (interactive) (org-export-as 'html)) "Org Export To HTML")
    ("t"  org-todo "Open At Point")
    )
  :general
  (:keymaps 'org-mode-map
	    "C-c m" 'amirreza/org-mode-hydra/body)
  (:keymaps 'org-src-mode-map
	    "C-c C-c" #'org-edit-src-exit
	    )
  (:states 'normal :keymaps 'org-mode-map "SPC m" 'amirreza/org-mode-hydra/body)
  )

(use-package ox-reveal)
(use-package ob-go)
(use-package ob-rust)
(use-package ob-php)
(use-package htmlize)
(use-package evil-org
  :if (boundp 'IS-EVIL) ;; Only if evil mode is enabled
  :hook (org-mode . evil-org-mode))

(use-package git-gutter
  :init
  (global-git-gutter-mode))

(use-package magit
  :general
  (:keymaps 'global-map "C-x g" 'magit)
  (:states 'normal "SPC g" 'magit)
  )

(use-package project
  :straight nil
  :general
  (:keymaps 'override "C-x p" 'amirreza/project-hydra/body)
  :init
  (defhydra amirreza/project-hydra (:exit t)
    ("f" project-find-file "Find File")
    ("p" project-switch-project "Switch To Project")
    ("b" project-buffers "Find Buffer In Project")
    ("c" project-compile "Compile Project")
  ))
