README.org
*** Programming
#+BEGIN_SRC emacs-lisp
(setq amirreza/programming-hydra-heads '())
#+END_SRC
**** Flymake
#+BEGIN_SRC emacs-lisp
  (use-package flymake
    :straight nil
    :init
    (add-to-list 'amirreza/programming-hydra-heads '("n" flymake-goto-next-error "Goto Next Error"))
    (add-to-list 'amirreza/programming-hydra-heads '("p" flymake-goto-previous-error "Goto Previous Error"))
    (add-to-list 'amirreza/programming-hydra-heads '("e" consult-flymake "List of errors")))

#+END_SRC
**** Xref
#+BEGIN_SRC emacs-lisp
  (use-package xref
    :straight nil
    :general
      (:keymaps 'global-map
		"M-." 'xref-find-definitions ;; Goto definitions
		"M-," 'xref-go-back ;; hop back where you where before jump
		"M-r" 'xref-find-references ;; Goto references
    ))
#+END_SRC
**** Eldoc
Eldoc is a core emacs package that can be used
to show documentation and possibly errors both in =echo-area=
and a seperate buffer.
#+BEGIN_SRC emacs-lisp
  (use-package eldoc
    :straight nil
    :init
    (setq eldoc-echo-area-use-multiline-p nil)
    (setq eldoc-echo-area-display-truncation-message nil)
    (setq eldoc-echo-area-prefer-doc-buffer nil)
    (add-to-list 'amirreza/programming-hydra-heads '("." amirreza/eldoc-toggle-buffer "Toggle Eldoc for point"))
    :general
    (:keymaps 'global-map
		  "C-h ." 'amirreza/eldoc-toggle-buffer ;; Toggle eldoc buffer
		  "M-0" 'amirreza/eldoc-toggle-buffer ;; Toggle eldoc buffer
		  )
  
    :config
    (setq amirreza/--eldoc-window-open 'close)

    (defun amirreza/eldoc-toggle-buffer ()
      "Toggle eldoc buffer."
      (interactive)
      (if (eq 'open amirreza/--eldoc-window-open)
	  (progn
	    (message "closing...")
	    (dolist (w (window-list))
	      (when (string-match-p "\\*eldoc.*" (buffer-name (window-buffer w)))
		(quit-window nil w)
		))
	    (setq amirreza/--eldoc-window-open 'close))
	(progn
	  (message "opening...")
	  (eldoc-doc-buffer t)
	  (setq amirreza/--eldoc-window-open 'open))
	))
    (global-eldoc-mode))
#+END_SRC
