index.html
<div id="outline-container-org9a833b9" class="outline-4">
<h4 id="org9a833b9"><span class="section-number-4">3.0.15.</span> Programming</h4>
<div class="outline-text-4" id="text-3-0-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">setq</span> amirreza/programming-hydra-heads '<span style="color: #ff79c6;">()</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org5c04cc5"></a>Flymake<br />
<div class="outline-text-5" id="text-3-0-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">flymake</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"n"</span> flymake-goto-next-error <span style="color: #f1fa8c;">"Goto Next Error"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"p"</span> flymake-goto-previous-error <span style="color: #f1fa8c;">"Goto Previous Error"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"e"</span> consult-flymake <span style="color: #f1fa8c;">"List of errors"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

</pre>
</div>
</div>
</li>
<li><a id="orgd3904f8"></a>Xref<br />
<div class="outline-text-5" id="text-3-0-15-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">xref</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:general</span>
    <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'global-map
              <span style="color: #f1fa8c;">"M-."</span> 'xref-find-definitions <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Goto definitions</span>
              <span style="color: #f1fa8c;">"M-,"</span> 'xref-go-back <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">hop back where you where before jump</span>
              <span style="color: #f1fa8c;">"M-r"</span> 'xref-find-references <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Goto references</span>
  <span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgc33ac8e"></a>Eldoc<br />
<div class="outline-text-5" id="text-3-0-15-3">
<p>
Eldoc is a core emacs package that can be used
to show documentation and possibly errors both in <code>echo-area</code>
and a seperate buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">eldoc</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> eldoc-echo-area-use-multiline-p nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> eldoc-echo-area-display-truncation-message nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> eldoc-echo-area-prefer-doc-buffer nil<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"."</span> amirreza/eldoc-toggle-buffer <span style="color: #f1fa8c;">"Toggle Eldoc for point"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'global-map
                <span style="color: #f1fa8c;">"C-h ."</span> 'amirreza/eldoc-toggle-buffer <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Toggle eldoc buffer</span>
                <span style="color: #f1fa8c;">"M-0"</span> 'amirreza/eldoc-toggle-buffer <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Toggle eldoc buffer</span>
                <span style="color: #ff79c6;">)</span>

  <span style="color: #ffb86c;">:config</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> amirreza/--eldoc-window-open 'close<span style="color: #ff79c6;">)</span>

  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/eldoc-toggle-buffer</span> <span style="color: #50fa7b;">()</span>
    <span style="color: #8995ba;">"Toggle eldoc buffer."</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">if</span> <span style="color: #bd93f9;">(</span>eq 'open amirreza/--eldoc-window-open<span style="color: #bd93f9;">)</span>
        <span style="color: #bd93f9;">(</span><span style="color: #ff79c6;">progn</span>
          <span style="color: #0189cc;">(</span>message <span style="color: #f1fa8c;">"closing..."</span><span style="color: #0189cc;">)</span>
          <span style="color: #0189cc;">(</span><span style="color: #ff79c6;">dolist</span> <span style="color: #61bfff;">(</span>w <span style="color: #ff79c6;">(</span>window-list<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
            <span style="color: #61bfff;">(</span><span style="color: #ff79c6;">when</span> <span style="color: #ff79c6;">(</span>string-match-p <span style="color: #f1fa8c;">"\\*eldoc.*"</span> <span style="color: #50fa7b;">(</span>buffer-name <span style="color: #bd93f9;">(</span>window-buffer w<span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
              <span style="color: #ff79c6;">(</span>quit-window nil w<span style="color: #ff79c6;">)</span>
              <span style="color: #61bfff;">)</span><span style="color: #0189cc;">)</span>
          <span style="color: #0189cc;">(</span><span style="color: #ff79c6;">setq</span> amirreza/--eldoc-window-open 'close<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span>
      <span style="color: #bd93f9;">(</span><span style="color: #ff79c6;">progn</span>
        <span style="color: #0189cc;">(</span>message <span style="color: #f1fa8c;">"opening..."</span><span style="color: #0189cc;">)</span>
        <span style="color: #0189cc;">(</span>eldoc-doc-buffer t<span style="color: #0189cc;">)</span>
        <span style="color: #0189cc;">(</span><span style="color: #ff79c6;">setq</span> amirreza/--eldoc-window-open 'open<span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span>
      <span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>global-eldoc-mode<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
