README.org
**** LSP (Eglot)
#+BEGIN_SRC emacs-lisp
  (use-package eglot
    :straight nil
    :hook
    ((go-mode rust-mode python-mode php-mode) . 'eglot-ensure)
    :init
    (add-to-list 'amirreza/programming-hydra-heads '("d" eldoc "Document THING at POINT"))
    (add-to-list 'amirreza/programming-hydra-heads '("D" xref-find-definitions "Goto Definitions"))
    (add-to-list 'amirreza/programming-hydra-heads '("r" xref-find-references "Find References"))
    (add-to-list 'amirreza/programming-hydra-heads '("i" eglot-find-implementation "Find Implementations"))
    (add-to-list 'amirreza/programming-hydra-heads '("s" consult-eglot-symbols "Workspace Symbols"))
    (add-to-list 'amirreza/programming-hydra-heads '("R" eglot-rename "Rename"))
    (add-to-list 'amirreza/programming-hydra-heads '("f" eglot-format "Format")))

    (use-package consult-eglot)
#+END_SRC
**** Hydra
#+BEGIN_SRC emacs-lisp
  ;; If a language has no specific keys other that programming one like rust they can map this.
  (amirreza/defhydra amirreza/programming-hydra (:exit t)
		     amirreza/programming-hydra-heads)

  (general-def 
    :keymaps 'prog-mode-map "C-c m" 'amirreza/programming-hydra/body)


  (general-def
    :keymaps 'prog-mode-map
    :states 'normal
    "SPC m" 'amirreza/programming-hydra/body)
#+END_SRC
**** Languages
***** Golang
#+BEGIN_SRC emacs-lisp
  (use-package go-mode
    :init
    (amirreza/defhydra amirreza/go-hydra
		       (:exit t)
		       (append amirreza/programming-hydra-heads '(("a" go-tag-add "Add Struct Tag"))))
    :general
    (:keymaps 'go-mode-map
	      "C-c m" 'amirreza/go-hydra/body)
    (:keymaps 'go-mode-map
	      "SPC m" 'amirreza/go-hydra/body)
    )


  (use-package go-tag)
#+END_SRC
***** Rust
#+BEGIN_SRC emacs-lisp
  (use-package rust-mode)
#+END_SRC
***** Clojure
#+BEGIN_SRC emacs-lisp
  (use-package clojure-mode) ;; LISP on JVM
  (use-package cider :after clojure-mode) ;; Clojure repl integrated into Emacs
#+END_SRC
***** Zig
#+BEGIN_SRC emacs-lisp
(use-package zig-mode) ;; Zig
#+END_SRC
***** Misc
#+BEGIN_SRC emacs-lisp
  (use-package apache-mode) ;; Apache config syntax
  (use-package systemd) ;; Systemd config syntax
  (use-package nginx-mode) ;; Nginx config syntax
  (use-package docker-compose-mode) ;; Docker-compose syntax
  (use-package dockerfile-mode) ;; Dockerfile syntax
  (use-package markdown-mode) ;; Markdown syntax
  (use-package yaml-mode) ;; Yaml
  (use-package fish-mode) ;; Fish
  (use-package csv-mode) ;; CSV
  (use-package json-mode) ;; Javascript Object Notation

#+END_SRC
