index.html
<li><a id="org7b14384"></a>LSP (Eglot)<br />
<div class="outline-text-5" id="text-3-0-15-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">eglot</span>
  <span style="color: #ffb86c;">:straight</span> nil
  <span style="color: #ffb86c;">:hook</span>
  <span style="color: #ff79c6;">(</span><span style="color: #50fa7b;">(</span>go-mode rust-mode python-mode php-mode<span style="color: #50fa7b;">)</span> . 'eglot-ensure<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"d"</span> eldoc <span style="color: #f1fa8c;">"Document THING at POINT"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"D"</span> xref-find-definitions <span style="color: #f1fa8c;">"Goto Definitions"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"r"</span> xref-find-references <span style="color: #f1fa8c;">"Find References"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"i"</span> eglot-find-implementation <span style="color: #f1fa8c;">"Find Implementations"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"s"</span> consult-eglot-symbols <span style="color: #f1fa8c;">"Workspace Symbols"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"R"</span> eglot-rename <span style="color: #f1fa8c;">"Rename"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>add-to-list 'amirreza/programming-hydra-heads '<span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"f"</span> eglot-format <span style="color: #f1fa8c;">"Format"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>

  <span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">consult-eglot</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org8bdc2f0"></a>Hydra<br />
<div class="outline-text-5" id="text-3-0-15-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6272a4;">;; </span><span style="color: #6272a4;">If a language has no specific keys other that programming one like rust they can map this.</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">amirreza/defhydra</span> amirreza/programming-hydra <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:exit</span> t<span style="color: #ff79c6;">)</span>
                   amirreza/programming-hydra-heads<span style="color: #61bfff;">)</span>

<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">general-def</span> 
  <span style="color: #ffb86c;">:keymaps</span> 'prog-mode-map <span style="color: #f1fa8c;">"C-c m"</span> 'amirreza/programming-hydra/body<span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">general-def</span>
  <span style="color: #ffb86c;">:keymaps</span> 'prog-mode-map
  <span style="color: #ffb86c;">:states</span> 'normal
  <span style="color: #f1fa8c;">"SPC m"</span> 'amirreza/programming-hydra/body<span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org9e107be"></a>Languages<br />
<ol class="org-ol">
<li><a id="org81b40a9"></a>Golang<br />
<div class="outline-text-6" id="text-3-0-15-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">go-mode</span>
  <span style="color: #ffb86c;">:init</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">amirreza/defhydra</span> amirreza/go-hydra
                     <span style="color: #50fa7b;">(</span><span style="color: #ffb86c;">:exit</span> t<span style="color: #50fa7b;">)</span>
                     <span style="color: #50fa7b;">(</span>append amirreza/programming-hydra-heads '<span style="color: #bd93f9;">(</span><span style="color: #0189cc;">(</span><span style="color: #f1fa8c;">"a"</span> go-tag-add <span style="color: #f1fa8c;">"Add Struct Tag"</span><span style="color: #0189cc;">)</span><span style="color: #bd93f9;">)</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'go-mode-map
            <span style="color: #f1fa8c;">"C-c m"</span> 'amirreza/go-hydra/body<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:keymaps</span> 'go-mode-map
            <span style="color: #f1fa8c;">"SPC m"</span> 'amirreza/go-hydra/body<span style="color: #ff79c6;">)</span>
  <span style="color: #61bfff;">)</span>


<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">go-tag</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgbfc9944"></a>Rust<br />
<div class="outline-text-6" id="text-3-0-15-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">rust-mode</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org5872f09"></a>Clojure<br />
<div class="outline-text-6" id="text-3-0-15-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">clojure-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">LISP on JVM</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">cider</span> <span style="color: #ffb86c;">:after</span> clojure-mode<span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Clojure repl integrated into Emacs</span>
</pre>
</div>
</div>
</li>
<li><a id="orgc52ae6d"></a>Zig<br />
<div class="outline-text-6" id="text-3-0-15-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">zig-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Zig</span>
</pre>
</div>
</div>
</li>
<li><a id="org5f38c7d"></a>Misc<br />
<div class="outline-text-6" id="text-3-0-15-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">apache-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Apache config syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">systemd</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Systemd config syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">nginx-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Nginx config syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">docker-compose-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Docker-compose syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">dockerfile-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Dockerfile syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">markdown-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Markdown syntax</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">yaml-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Yaml</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">fish-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Fish</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">csv-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">CSV</span>
<span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">json-mode</span><span style="color: #61bfff;">)</span> <span style="color: #6272a4;">;; </span><span style="color: #6272a4;">Javascript Object Notation</span>

</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
