README.org
*** Workspaces
#+BEGIN_SRC emacs-lisp
  (use-package perspective
    :init
  
    (setq persp-state-default-file (expand-file-name "sessions" user-emacs-directory))
    (setq persp-mode-prefix-key (kbd "C-c w"))


    (defun amirreza/save-session ()
      (interactive)
      (persp-state-save persp-state-default-file))


    (defun amirreza/load-session ()
      (interactive)
      (persp-state-load persp-state-default-file))
    (persp-mode 1)
    :hook
    (kill-emacs . amirreza/save-session)
    :general
    (:prefix "C-c w" :keymaps 'override "s" 'persp-switch)
    (:prefix "SPC w" :states 'normal :keymaps 'override "s" 'persp-switch)

    )
#+END_SRC
*** macOS setup
#+BEGIN_SRC emacs-lisp
  (when (string-equal system-type "darwin")
      (setq mac-command-modifier 'meta)
      (setq mac-option-modifier 'meta))
#+END_SRC
* Kitty
*** Themes
**** Dracula
#+BEGIN_SRC :tangle no
##+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  foreground            #f8f8f2
  background            #282a36
  selection_foreground  #ffffff
  selection_background  #44475a

  url_color #8be9fd

  # black
  color0  #21222c
  color8  #6272a4

  # red
  color1  #ff5555
  color9  #ff6e6e

  # green
  color2  #50fa7b
  color10 #69ff94

  # yellow
  color3  #f1fa8c
  color11 #ffffa5

  # blue
  color4  #bd93f9
  color12 #d6acff

  # magenta
  color5  #ff79c6
  color13 #ff92df

  # cyan
  color6  #8be9fd
  color14 #a4ffff

  # white
  color7  #f8f8f2
  color15 #ffffff

  # Cursor colors
  cursor            #f8f8f2
  cursor_text_color background

  # Tab bar colors
  active_tab_foreground   #282a36
  active_tab_background   #f8f8f2
  inactive_tab_foreground #282a36
  inactive_tab_background #6272a4

  # Marks
  mark1_foreground #282a36
  mark1_background #ff5555

  # Splits/Windows
  active_border_color #f8f8f2
  inactive_border_color #6272a4


#+END_SRC
*** Font
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  # Font configuration
  # font_family OperatorMono Nerd Font Medium
  # bold_font OperatorMono Nerd Font Bold
  # italic_font  OperatorMono Nerd Font Italic
  # bold_italic_font OperatorMono Nerd Font Bold Italic

  font_family FiraCode Nerd Font Mono Medium
  bold_font FiraCode Nerd Font Mono Bold
  italic_font  FiraCode Nerd Font Mono Italic
  bold_italic_font FiraCode Nerd Font Mono Bold Italic

  # font_family JetBrainsMono Nerd Font Mono Regular
  # bold_font JetBrainsMono Nerd Font Mono Bold
  # italic_font JetBrainsMono Nerd Font Mono Italic
  # bold_italic_font JetBrainsMono Nerd Font Mono Bold Italic
  font_size 18
#+END_SRC
*** Cursor
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  shell_integration no-cursor
  cursor_shape block
  cursor_blink_interval 0
#+END_SRC
*** Performance
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  sync_to_monitor yes
  repaint_delay 5
  input_delay 2
#+END_SRC
*** No Audio Bell
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  enable_audio_bell no
#+END_SRC
*** Keybindings
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  clear_all_shortcuts yes

  kitty_mod ctrl+shift

  map mod+equal change_font_size all +2.0
  map mod+minus change_font_size all -2.0

  map cmd+equal change_font_size all +2.0
  map cmd+minus change_font_size all -2.0

  map cmd+c copy_to_clipboard
  map cmd+v paste_from_clipboard

  map cmd+t new_tab
  map cmd+left previous_tab
  map cmd+right next_tab
#+END_SRC
*** Tab bar
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  tab_bar_align left
  tab_bar_edge bottom

  tab_title_template "{title}"
#+END_SRC
*** macOS
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  macos_titlebar_color               background
  macos_option_as_alt                both
  macos_quit_when_last_window_closed yes
  macos_show_window_title_in         none
  macos_custom_beam_cursor           yes
#+END_SRC
*** Terminal Type
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  term xterm-256color
#+END_SRC
*** Background Opacity
#+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  background_opacity 0.90
#+END_SRC
* Zsh
*** Shebang
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
  #!/usr/bin/env zsh
#+END_SRC
