index.html
<div id="outline-container-orgf9186e1" class="outline-4">
<h4 id="orgf9186e1"><span class="section-number-4">3.0.16.</span> Workspaces</h4>
<div class="outline-text-4" id="text-3-0-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">use-package</span> <span style="color: #8be9fd;">perspective</span>
  <span style="color: #ffb86c;">:init</span>

  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> persp-state-default-file <span style="color: #50fa7b;">(</span>expand-file-name <span style="color: #f1fa8c;">"sessions"</span> user-emacs-directory<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> persp-mode-prefix-key <span style="color: #50fa7b;">(</span>kbd <span style="color: #f1fa8c;">"C-c w"</span><span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>


  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/save-session</span> <span style="color: #50fa7b;">()</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>persp-state-save persp-state-default-file<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>


  <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">defun</span> <span style="color: #50fa7b;">amirreza/load-session</span> <span style="color: #50fa7b;">()</span>
    <span style="color: #50fa7b;">(</span><span style="color: #ff79c6;">interactive</span><span style="color: #50fa7b;">)</span>
    <span style="color: #50fa7b;">(</span>persp-state-load persp-state-default-file<span style="color: #50fa7b;">)</span><span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span>persp-mode 1<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:hook</span>
  <span style="color: #ff79c6;">(</span>kill-emacs . amirreza/save-session<span style="color: #ff79c6;">)</span>
  <span style="color: #ffb86c;">:general</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:prefix</span> <span style="color: #f1fa8c;">"C-c w"</span> <span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"s"</span> 'persp-switch<span style="color: #ff79c6;">)</span>
  <span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">:prefix</span> <span style="color: #f1fa8c;">"SPC w"</span> <span style="color: #ffb86c;">:states</span> 'normal <span style="color: #ffb86c;">:keymaps</span> 'override <span style="color: #f1fa8c;">"s"</span> 'persp-switch<span style="color: #ff79c6;">)</span>

  <span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org462a0a3" class="outline-4">
<h4 id="org462a0a3"><span class="section-number-4">3.0.17.</span> macOS setup</h4>
<div class="outline-text-4" id="text-3-0-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #61bfff;">(</span><span style="color: #ff79c6;">when</span> <span style="color: #ff79c6;">(</span>string-equal system-type <span style="color: #f1fa8c;">"darwin"</span><span style="color: #ff79c6;">)</span>
    <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> mac-command-modifier 'meta<span style="color: #ff79c6;">)</span>
    <span style="color: #ff79c6;">(</span><span style="color: #ff79c6;">setq</span> mac-option-modifier 'meta<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org22446bf" class="outline-2">
<h2 id="org22446bf"><span class="section-number-2">4.</span> Kitty</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org655d788" class="outline-4">
<h4 id="org655d788"><span class="section-number-4">4.0.1.</span> Themes</h4>
<div class="outline-text-4" id="text-4-0-1">
</div>
<ol class="org-ol">
<li><a id="orga87efa2"></a>Dracula<br />
<div class="outline-text-5" id="text-4-0-1-1">
<div class="org-src-container">
<pre class="src src-:tangle">##+BEGIN_SRC conf :tangle ~/.config/kitty/kitty.conf :mkdirp yes
  foreground            #f8f8f2
  background            #282a36
  selection_foreground  #ffffff
  selection_background  #44475a

  url_color #8be9fd

  # black
  color0  #21222c
  color8  #6272a4

  # red
  color1  #ff5555
  color9  #ff6e6e

  # green
  color2  #50fa7b
  color10 #69ff94

  # yellow
  color3  #f1fa8c
  color11 #ffffa5

  # blue
  color4  #bd93f9
  color12 #d6acff

  # magenta
  color5  #ff79c6
  color13 #ff92df

  # cyan
  color6  #8be9fd
  color14 #a4ffff

  # white
  color7  #f8f8f2
  color15 #ffffff

  # Cursor colors
  cursor            #f8f8f2
  cursor_text_color background

  # Tab bar colors
  active_tab_foreground   #282a36
  active_tab_background   #f8f8f2
  inactive_tab_foreground #282a36
  inactive_tab_background #6272a4

  # Marks
  mark1_foreground #282a36
  mark1_background #ff5555

  # Splits/Windows
  active_border_color #f8f8f2
  inactive_border_color #6272a4


</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge69c6c0" class="outline-4">
<h4 id="orge69c6c0"><span class="section-number-4">4.0.2.</span> Font</h4>
<div class="outline-text-4" id="text-4-0-2">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #6272a4;"># </span><span style="color: #6272a4;">Font configuration</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">font_family OperatorMono Nerd Font Medium</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">bold_font OperatorMono Nerd Font Bold</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">italic_font  OperatorMono Nerd Font Italic</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">bold_italic_font OperatorMono Nerd Font Bold Italic</span>

font_family FiraCode Nerd Font Mono Medium
bold_font FiraCode Nerd Font Mono Bold
italic_font  FiraCode Nerd Font Mono Italic
bold_italic_font FiraCode Nerd Font Mono Bold Italic

<span style="color: #6272a4;"># </span><span style="color: #6272a4;">font_family JetBrainsMono Nerd Font Mono Regular</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">bold_font JetBrainsMono Nerd Font Mono Bold</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">italic_font JetBrainsMono Nerd Font Mono Italic</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">bold_italic_font JetBrainsMono Nerd Font Mono Bold Italic</span>
font_size 18
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f8c816" class="outline-4">
<h4 id="org0f8c816"><span class="section-number-4">4.0.3.</span> Cursor</h4>
<div class="outline-text-4" id="text-4-0-3">
<div class="org-src-container">
<pre class="src src-conf">shell_integration no-cursor
cursor_shape block
cursor_blink_interval 0
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a18c3a" class="outline-4">
<h4 id="org3a18c3a"><span class="section-number-4">4.0.4.</span> Performance</h4>
<div class="outline-text-4" id="text-4-0-4">
<div class="org-src-container">
<pre class="src src-conf">sync_to_monitor yes
repaint_delay 5
input_delay 2
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf70fba" class="outline-4">
<h4 id="orgbf70fba"><span class="section-number-4">4.0.5.</span> No Audio Bell</h4>
<div class="outline-text-4" id="text-4-0-5">
<div class="org-src-container">
<pre class="src src-conf">enable_audio_bell no
</pre>
</div>
</div>
</div>
<div id="outline-container-orga463911" class="outline-4">
<h4 id="orga463911"><span class="section-number-4">4.0.6.</span> Keybindings</h4>
<div class="outline-text-4" id="text-4-0-6">
<div class="org-src-container">
<pre class="src src-conf">clear_all_shortcuts yes

kitty_mod ctrl+shift

map mod+equal change_font_size all +2.0
map mod+minus change_font_size all -2.0

map cmd+equal change_font_size all +2.0
map cmd+minus change_font_size all -2.0

map cmd+c copy_to_clipboard
map cmd+v paste_from_clipboard

map cmd+t new_tab
map cmd+left previous_tab
map cmd+right next_tab
</pre>
</div>
</div>
</div>
<div id="outline-container-org0fac086" class="outline-4">
<h4 id="org0fac086"><span class="section-number-4">4.0.7.</span> Tab bar</h4>
<div class="outline-text-4" id="text-4-0-7">
<div class="org-src-container">
<pre class="src src-conf">tab_bar_align left
tab_bar_edge bottom

tab_title_template <span style="color: #f1fa8c;">"{title}"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb135776" class="outline-4">
<h4 id="orgb135776"><span class="section-number-4">4.0.8.</span> macOS</h4>
<div class="outline-text-4" id="text-4-0-8">
<div class="org-src-container">
<pre class="src src-conf">macos_titlebar_color               background
macos_option_as_alt                both
macos_quit_when_last_window_closed yes
macos_show_window_title_in         none
macos_custom_beam_cursor           yes
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f5b03a" class="outline-4">
<h4 id="org6f5b03a"><span class="section-number-4">4.0.9.</span> Terminal Type</h4>
<div class="outline-text-4" id="text-4-0-9">
<div class="org-src-container">
<pre class="src src-conf">term xterm-256color
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f12b0d" class="outline-4">
<h4 id="org1f12b0d"><span class="section-number-4">4.0.10.</span> Background Opacity</h4>
<div class="outline-text-4" id="text-4-0-10">
<div class="org-src-container">
<pre class="src src-conf">background_opacity 0.90
</pre>
</div>
</div>
</div>
</div>
