.emacs.d/init.el

(use-package perspective
  :init

  (setq persp-state-default-file (expand-file-name "sessions" user-emacs-directory))
  (setq persp-mode-prefix-key (kbd "C-c w"))


  (defun amirreza/save-session ()
    (interactive)
    (persp-state-save persp-state-default-file))


  (defun amirreza/load-session ()
    (interactive)
    (persp-state-load persp-state-default-file))
  (persp-mode 1)
  :hook
  (kill-emacs . amirreza/save-session)
  :general
  (:prefix "C-c w" :keymaps 'override "s" 'persp-switch)
  (:prefix "SPC w" :states 'normal :keymaps 'override "s" 'persp-switch)

  )

(when (string-equal system-type "darwin")
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'meta))

