README.org
*** Antigen Setup
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
  [ ! -f "$HOME/.antigen.zsh" ] && curl -L git.io/antigen > antigen.zsh
  source $HOME/.antigen.zsh
#+END_SRC
*** Plugins
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
  antigen use oh-my-zsh
  antigen bundle zsh-users/zsh-syntax-highlighting
  antigen bundle zsh-users/zsh-autosuggestions
  antigen bundle unixorn/fzf-zsh-plugin@main
  antigen apply
#+END_SRC
*** Environment Variables
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
  export GO111MODULE='on'
  export GOPATH="$HOME"
  export GOPRIVATE='gitlab.snapp.ir'
  export GOPROXY='goproxy.io,direct'
  export EDITOR='emacsclient -t -a ""'
  export PATH="$HOME/.emacs.d/bin/:/Applications/Emacs.app/Contents/MacOS:$GOPATH/bin:/opt/homebrew/bin::$HOME/.config/composer/vendor/bin:$GOROOT/bin:$HOME/.cargo/bin:$HOME/.local/bin:$PATH:$HOME/.composer/vendor/bin"

  [ -f "$HOME/.ghcup/env" ] && source "$HOME/.ghcup/env" # ghcup-env
  [ -f "$HOME/.cargo/env" ] && . "$HOME/.cargo/env"

  export HOMEBREW_NO_AUTO_UPDATE=1

  export FZF_DEFAULT_OPTS='--height 20%'
  export FZF_DEFAULT_COMMAND='rg --files'

  ss_proxy() {
      export http_proxy='http://localhost:1087'
      export https_proxy='http://localhost:1087'
  }


#+END_SRC
*** Aliases
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
  alias emacs='emacsclient -t -a ""'
  alias e='emacs'
#+END_SRC
*** Starship prompt
#+BEGIN_SRC sh :tangle ~/.zshrc :mkdirp yes
if ! command -v starship &> /dev/null
then
    curl -sS https://starship.rs/install.sh | sh
fi
eval "$(starship init zsh)"
#+END_SRC
* Git Global Config
*** User Info
#+BEGIN_SRC config :tangle ~/.config/git/config :mkdirp yes
[user]
	email = raskarpour@gmail.com
	name = amirrezaask
#+END_SRC
#+BEGIN_SRC config :tangle ~/.config/git/config :mkdirp yes
[alias]
  lg = log --graph --pretty=format:'%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr)%Creset' --abbrev-commit --date=relative

[push]
  default = current

[interactive]
   diffFilter = delta --color-only

[core]
    pager = delta

[interactive]
    diffFilter = delta --color-only

[delta]
    navigate = true  # use n and N to move between diff sections

[merge]
    conflictstyle = diff3

[diff]
    colorMoved = default
# https://github.com/dandavison/delta 

#+END_SRC
