index.html
<div id="outline-container-org4689887" class="outline-2">
<h2 id="org4689887"><span class="section-number-2">5.</span> Zsh</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc1e0676" class="outline-4">
<h4 id="orgc1e0676"><span class="section-number-4">5.0.1.</span> Shebang</h4>
<div class="outline-text-4" id="text-5-0-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6272a4;">#</span><span style="color: #6272a4;">!/usr/bin/</span><span style="color: #ff79c6;">env</span><span style="color: #6272a4;"> zsh</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org519966e" class="outline-4">
<h4 id="org519966e"><span class="section-number-4">5.0.2.</span> Antigen Setup</h4>
<div class="outline-text-4" id="text-5-0-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #61bfff;">[</span> <span style="color: #bd93f9; font-weight: bold;">!</span> -f <span style="color: #f1fa8c;">"$HOME/.antigen.zsh"</span> <span style="color: #61bfff;">]</span> &amp;&amp; curl -L git.io/antigen &gt; antigen.zsh
<span style="color: #ffb86c;">source</span> $<span style="color: #ffc9e8;">HOME</span>/.antigen.zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc39ab91" class="outline-4">
<h4 id="orgc39ab91"><span class="section-number-4">5.0.3.</span> Plugins</h4>
<div class="outline-text-4" id="text-5-0-3">
<div class="org-src-container">
<pre class="src src-sh">antigen use oh-my-zsh
antigen bundle zsh-users/zsh-syntax-highlighting
antigen bundle zsh-users/zsh-autosuggestions
antigen bundle unixorn/fzf-zsh-plugin@main
antigen apply
</pre>
</div>
</div>
</div>
<div id="outline-container-org3990960" class="outline-4">
<h4 id="org3990960"><span class="section-number-4">5.0.4.</span> Environment Variables</h4>
<div class="outline-text-4" id="text-5-0-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">GO111MODULE</span>=<span style="color: #f1fa8c;">'on'</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">GOPATH</span>=<span style="color: #f1fa8c;">"$HOME"</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">GOPRIVATE</span>=<span style="color: #f1fa8c;">'gitlab.snapp.ir'</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">GOPROXY</span>=<span style="color: #f1fa8c;">'goproxy.io,direct'</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">EDITOR</span>=<span style="color: #f1fa8c;">'emacsclient -t -a ""'</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">PATH</span>=<span style="color: #f1fa8c;">"$HOME/.emacs.d/bin/:/Applications/Emacs.app/Contents/MacOS:$GOPATH/bin:/opt/homebrew/bin::$HOME/.config/composer/vendor/bin:$GOROOT/bin:$HOME/.cargo/bin:$HOME/.local/bin:$PATH:$HOME/.composer/vendor/bin"</span>

<span style="color: #61bfff;">[</span> -f <span style="color: #f1fa8c;">"$HOME/.ghcup/env"</span> <span style="color: #61bfff;">]</span> &amp;&amp; <span style="color: #ffb86c;">source</span> <span style="color: #f1fa8c;">"$HOME/.ghcup/env"</span> <span style="color: #6272a4;"># </span><span style="color: #6272a4;">ghcup-env</span>
<span style="color: #61bfff;">[</span> -f <span style="color: #f1fa8c;">"$HOME/.cargo/env"</span> <span style="color: #61bfff;">]</span> &amp;&amp; . <span style="color: #f1fa8c;">"$HOME/.cargo/env"</span>

<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">HOMEBREW_NO_AUTO_UPDATE</span>=1

<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">FZF_DEFAULT_OPTS</span>=<span style="color: #f1fa8c;">'--height 20%'</span>
<span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">FZF_DEFAULT_COMMAND</span>=<span style="color: #f1fa8c;">'rg --files'</span>

<span style="color: #50fa7b;">ss_proxy</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">http_proxy</span>=<span style="color: #f1fa8c;">'http://localhost:1087'</span>
    <span style="color: #ffb86c;">export</span> <span style="color: #ffc9e8;">https_proxy</span>=<span style="color: #f1fa8c;">'http://localhost:1087'</span>
<span style="color: #61bfff;">}</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0eb8a5" class="outline-4">
<h4 id="orgd0eb8a5"><span class="section-number-4">5.0.5.</span> Aliases</h4>
<div class="outline-text-4" id="text-5-0-5">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffb86c;">alias</span> <span style="color: #ffc9e8;">emacs</span>=<span style="color: #f1fa8c;">'emacsclient -t -a ""'</span>
<span style="color: #ffb86c;">alias</span> <span style="color: #ffc9e8;">e</span>=<span style="color: #f1fa8c;">'emacs'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b3dd25" class="outline-4">
<h4 id="org7b3dd25"><span class="section-number-4">5.0.6.</span> Starship prompt</h4>
<div class="outline-text-4" id="text-5-0-6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ff79c6;">if</span> <span style="color: #bd93f9; font-weight: bold;">!</span> command -v starship &amp;&gt; /dev/null
<span style="color: #ff79c6;">then</span>
    curl -sS https://starship.rs/install.sh | sh
<span style="color: #ff79c6;">fi</span>
<span style="color: #ffb86c;">eval</span> <span style="color: #f1fa8c;">"$(starship init zsh)"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga319a47" class="outline-2">
<h2 id="orga319a47"><span class="section-number-2">6.</span> Git Global Config</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org288fcef" class="outline-4">
<h4 id="org288fcef"><span class="section-number-4">6.0.1.</span> User Info</h4>
<div class="outline-text-4" id="text-6-0-1">
<div class="org-src-container">
<pre class="src src-config">[user]
        email = raskarpour@gmail.com
        name = amirrezaask
</pre>
</div>
<div class="org-src-container">
<pre class="src src-config">[alias]
  lg = log --graph --pretty=format:'%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr)%Creset' --abbrev-commit --date=relative

[push]
  default = current

[interactive]
   diffFilter = delta --color-only

[core]
    pager = delta

[interactive]
    diffFilter = delta --color-only

[delta]
    navigate = true  # use n and N to move between diff sections

[merge]
    conflictstyle = diff3

[diff]
    colorMoved = default
# https://github.com/dandavison/delta 

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Amirreza Askarpour</p>
<p class="date">Created: 2023-01-01 Sun 04:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>